# Tweets in Bangkok (Siam to Grand Palace Area) visualization

lat-long: [100.484605,13.685780,100.584605,13.785780]

## Import zone

In [55]:
import pandas as pd
from mtranslate import translate
import pickle

## function zone

In [43]:
def trans_to_en(word):
    translate(word,'en')

In [61]:
def save_obj(file, obj):
    with open(file, 'wb') as f:
        pickle.dump(obj, f)

def load_obj(file, obj):
    with open(file, 'rb') as f:
        obj = pickle.load(f)

## Data zone

In [29]:
f = open('BKK_th-en_tweets_gamcom.txt','r',encoding='utf-8')

In [30]:
tweet_list = []
for line in f:
    tweet_list.append(line.split('\t'))

In [31]:
print(tweet_list[0])

['58872847', 'amp_cuband', '1001468679140270080', '@jjiab จริงค่ะ ส่วนตัวคิดว่าแบบนั้นดีแล้ว', '2018-05-29 14:21:54', '-1', '-1', 'Sathon', '100.508189, 13.700842', '100.553474, 13.725971', 'th\n']

In [32]:
labels = ['acc_id','acc','tweet_id','text','created_time','ex_lat','ex_long','place','lot_sw','lot_ne','lang']
tweet_df = pd.DataFrame(tweet_list,columns=labels)

In [33]:
tweet_df['lang'] = tweet_df['lang'].apply(lambda x: x.strip())

In [34]:
tweet_df.head()

,acc_id,acc,tweet_id,text,created_time,ex_lat,ex_long,place,lot_sw,lot_ne,lang
0,58872847,amp_cuband,1001468679140270080,@jjiab จริงค่ะ ส่วนตัวคิดว่าแบบนั้นดีแล้ว,2018-05-29 14:21:54,-1,-1,Sathon,"100.508189, 13.700842","100.553474, 13.725971",th
1,168438587,Porschephranot,1001468684752248834,@mju_zik ว่าไงจ๊ะ,2018-05-29 14:21:55,-1,-1,Rong Mueang,"100.515532, 13.735617","100.524483, 13.75308",th
2,260726562,mangokarn,1001468689105936384,@eyejaekris อร่อยยยยยย,2018-05-29 14:21:56,-1,-1,สาทร,"100.514643, 13.700842","100.537444, 13.715906",th
3,2668781561,__hxnxx,1001468699784634369,As much as I feel saddened by Ali Banats death...,2018-05-29 14:21:59,-1,-1,กรุงเทพมหานคร,"100.327737, 13.494097","100.938408, 13.955111",en
4,104415934,devoteraphar,1001468727756574720,"I'm at Police General Hospital in Pathum Wan, ...",2018-05-29 14:22:05,13.74321493,100.53976065,Pathum Wan,"100.528375, 13.72951","100.541027, 13.749708",en

In [35]:
tweet_df.describe()

,acc_id,acc,tweet_id,text,created_time,ex_lat,ex_long,place,lot_sw,lot_ne,lang
count,2660,2660,2660,2660,2660,2660,2660,2660,2660,2660,2660
unique,1127,1128,2660,2659,2526,85,85,139,87,86,2
top,144851766,SiRiPALIT,1001510464306561024,หิว,2018-05-29 16:07:56,-1,-1,Myanmar,"97.343365, 5.612531","105.636107, 20.46519",th
freq,47,47,1,2,3,2553,2553,213,237,237,2147

In [36]:
tweet_df = tweet_df[tweet_df.place != 'Myanmar']
tweet_df.describe()

,acc_id,acc,tweet_id,text,created_time,ex_lat,ex_long,place,lot_sw,lot_ne,lang
count,2447,2447,2447,2447,2447,2447,2447,2447,2447,2447,2447
unique,1066,1066,2447,2446,2330,80,80,138,86,85,2
top,144851766,SiRiPALIT,1001510464306561024,หิว,2018-05-29 15:14:50,-1,-1,ประเทศไทย,"97.343365, 5.612531","105.636107, 20.46519",th
freq,47,47,1,2,3,2353,2353,138,237,237,2144

## Translating zone

In [37]:
tweet_df['place'].unique()

array(['Sathon', 'Rong Mueang', 'สาทร', 'กรุงเทพมหานคร', 'Pathum Wan',
       'ประเทศไทย', 'วชิรพยาบาล', 'Thailand', 'รองเมือง', 'Lumphini',
       'ราชเทวี', 'Din Daeng', 'Bangkok Yai', 'ปทุมวัน', 'Phra Khanong',
       'Huai Khwang', 'คลองต้นไทร', 'ลุมพินี', 'Suriya Wong', 'Silom',
       'Bang Khlo', 'Khlong Tan Nuea', 'Ratchathewi', 'Khlong Toei',
       'Bangkok', 'พญาไท', 'Samsen Nok', 'Bang Pakok', 'คลองตันเหนือ',
       'Khlong Ton Sai', 'บางมด 1', 'บางพลัด', 'Yannawa', 'พระโขนงเหนือ',
       'วังใหม่', 'ถนนเพชรบุรี', 'ดินแดง', 'บางโพงพาง', 'พระโขนง',
       'Thanon Phaya Thai', 'Khlong San', 'Bang Bumru', 'Bukkhalo',
       'มักกะสัน', 'Wachira Phayaban', 'บางขุนพรหม', 'Phaya Thai',
       'Phra Khanong Nuea', 'สีลม', 'บางกอกใหญ่', 'Wang Mai',
       'Wat Phraya Krai', 'บางกะปิ', 'คลองสาน', 'Makkasan', 'ตลาดน้อย',
       'อ.พระประแดง', 'มหาพฤฒาราม', 'ดุสิต', 'Talat Noi', 'ห้วยขวาง',
       'Thung Maha Mek', 'Bang Phong Phang', 'วัดพระยาไกร', 'สามเสนนอก',
       'Ban Bat', 'Thanon Phetchaburi', 'บุคคโล', 'Vadhana', 'Si Phraya',
       'Chom Thong', 'Bang Lamphu Lang', 'ทุ่งมหาเมฆ',
       'Pom Prap Sattru Phai', 'Bangkok Noi', 'ถนนนครไชยศรี',
       'Bang Phlat', 'วัดราชบพิธ', 'Khlong Tan', 'Dao Khanong', 'วัฒนา',
       'Bang Kapi', 'ยานนาวา', 'ถนนพญาไท', 'Arun Amarin', 'บางยี่ขัน',
       'Bang Rak', 'Bang Khun Phrom', 'Thanon Nakhon Chai Si', 'สี่พระยา',
       'สุริยวงศ์', 'คลองเตย', 'บางลำภูล่าง', 'อรุณอมรินทร์',
       'Wang Burapha Phirom', 'บางโคล่', 'Samre', 'ราษฎร์บูรณะ', 'จอมทอง',
       'คลองตัน', 'Bang Mot 1', 'บางกอกน้อย', 'Talat Yot', 'บางกะเจ้า',
       'Si Yaek Maha Nak', 'สำเหร่', 'Phra Borom Maha Ratchawang',
       'Bang Kho Laem', 'Bang Yi Khan', 'Bowon Niwet', 'Dusit',
       'Maha Phruttharam', 'บางบำหรุ', 'Samran Rat', 'Wat Arun',
       'Ban Phan Thom', 'บางปะกอก', 'Samphanthawong', 'บางคอแหลม',
       'สมเด็จเจ้าพระยา', 'ดาวคะนอง', 'หิรัญรูจี', 'พระบรมมหาราชวัง',
       'Hiranruchi', 'Suan Chitlada', 'พระนคร', 'Wat Ratchabophit',
       'Wat Thep Sirin', 'คลองมหานาค', 'สวนจิตรลดา', 'Wat Kanlaya',
       'ป้อมปราบศัตรูพ่าย', 'บางรัก', 'Thon Buri', 'วัดอรุณ',
       'วัดกัลยาณ์', 'ธนบุรี', 'Wat Sam Phraya'], dtype=object)

In [41]:
print(translate('พระบรมมหาราชวัง','en'))

Grand Palace

In [52]:
#tweet_df['acc'] = tweet_df['acc'].apply(lambda x: translate(x,'en'))

In [50]:
#tweet_df['place'] = tweet_df['place'].apply(lambda x: translate(x,'en'))

In [51]:
#tweet_df['textt'] = tweet_df['text'].apply(lambda x: translate(x,'en'))

In [57]:
#save_obj('translated_tweet', tweet_df)

In [67]:
with open('translated_tweet','rb') as f:
    tweet_df = pickle.load(f)

In [68]:
tweet_df.head()

,acc_id,acc,tweet_id,text,created_time,ex_lat,ex_long,place,lot_sw,lot_ne,lang
0,58872847,amp_cuband,1001468679140270080,@jjiab I personally think that's fine.,2018-05-29 14:21:54,-1,-1,Sathon,"100.508189, 13.700842","100.553474, 13.725971",th
1,168438587,Porschephranot,1001468684752248834,@mj_zik,2018-05-29 14:21:55,-1,-1,Rong Mueang,"100.515532, 13.735617","100.524483, 13.75308",th
2,260726562,mangokarn,1001468689105936384,Thanks for sharing!,2018-05-29 14:21:56,-1,-1,Sathorn,"100.514643, 13.700842","100.537444, 13.715906",th
3,2668781561,__hxnxx,1001468699784634369,As much as I feel saddened by Ali Banats death...,2018-05-29 14:21:59,-1,-1,Bangkok,"100.327737, 13.494097","100.938408, 13.955111",en
4,104415934,devoteraphar,1001468727756574720,"I'm at Police General Hospital in Pathum Wan, ...",2018-05-29 14:22:05,13.74321493,100.53976065,Pathum Wan,"100.528375, 13.72951","100.541027, 13.749708",en

In [69]:
tweet_en = tweet_df[tweet_df.lang=='en']
tweet_th = tweet_df[tweet_df.lang=='th']

In [73]:
tweet_en.describe()

,acc_id,acc,tweet_id,text,created_time,ex_lat,ex_long,place,lot_sw,lot_ne,lang
count,303,303,303,303,303,303,303,303,303,303,303
unique,198,198,303,303,299,56,55,69,61,60,1
top,983194539048480769,preshtawiah,1001622501053550593,@IDFSpokesperson @NYCREMilton This is sad.,2018-05-29 16:07:01,-1,-1,Khlong Toei,"100.55061, 13.697698","100.588204, 13.742692",en
freq,21,21,1,1,2,240,240,31,34,34,303

In [74]:
tweet_th.describe()

,acc_id,acc,tweet_id,text,created_time,ex_lat,ex_long,place,lot_sw,lot_ne,lang
count,2144,2144,2144,2144,2144,2144,2144,2144,2144,2144,2144
unique,907,907,2144,1916,2054,26,27,113,84,83,1
top,144851766,SiRiPALIT,1001510464306561024,I'm not sure what to say.,2018-05-29 15:19:24,-1,-1,Thailand,"97.343365, 5.612531","105.636107, 20.46519",th
freq,47,47,1,40,3,2113,2113,224,224,224,2144